# Equals Method (StructuralAsset) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..Equals Method (StructuralAsset)
StructuralAsset Class See Also
---
Determines whether this structural asset is equal to another.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool Equals(
	StructuralAsset other
)
```

Visual Basic
---
```text
Public Function Equals ( _
	other As StructuralAsset _
) As Boolean
```

Visual C++
---
```text
public:
bool Equals(
	StructuralAsset^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..StructuralAsset The structural asset with which to compare this structural asset.
# ### Return Value
True if the given structural asset is equal to this one, otherwise false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralAsset Class
Equals Overload
Autodesk.Revit.DB Namespace